source/_erlang/tsung-http.xml
<?xml version="1.0"?>
<!DOCTYPE tsung SYSTEM "tsung-1.0.dtd">
<tsung loglevel="notice" dumptraffic="false" version="1.0">
    <!-- 客户端 -->
    <clients>
        <client host="localhost" use_controller_vm="false"></client>
    </clients>

    <!-- 服务器 -->
    <servers>
        <server host='www.guitarworld.com.cn' port='80' type='tcp'/>
    </servers>

    <!-- 负载 -->
    <load>
        <arrivalphase phase="1" duration="15" unit="minute">
            <users maxnumber="10000" interarrival="0.0025" unit="second"></users>
        </arrivalphase>
    </load>

    <!-- 选项 -->
    <options>
        <option type="ts_http" name="user_agent">
            <user_agent probability="80">Mozilla/5.0 (X11; U; Linux i686; en-US; rv:1.7.8) Gecko/20050513 Galeon/1.3.21</user_agent>
            <user_agent probability="20">Mozilla/5.0 (Windows; U; Windows NT 5.2; fr-FR; rv:1.7.8) Gecko/20050511 Firefox/1.0.4</user_agent>
        </option>
    </options>

    <!-- 会话 -->
    <sessions>
        <session name="http-example" probability="100" type="ts_http">
            <request>
                <http url="/" method="GET" version="1.1"/>
            </request>
        </session>
    </sessions>
</tsung>